/*
	クリッピング、拡大縮小、半透明対応描画ルーチン		by そとのひと
*/


#include "types.h"

#define	DRAW_NORMAL					0x00000000	// 00000000 00000000 00000000 00000000	通常方向
#define	DRAW_REV_UD					0x00000001	// 00000000 00000000 00000000 00000001	上下反転
#define	DRAW_REV_LR					0x00000002	// 00000000 00000000 00000000 00000010	左右反転


#define DRAW_ZOOMX					0x00001000	// 00000000 00000000 00010000 00000000	縦拡大
#define DRAW_ZOOMY					0x00002000	// 00000000 00000000 00100000 00000000	横拡大


#define	DRAW_BRIGHTNESS				0x00100000	// 00000000 00010000 00000000 00000000	輝度
#define	DRAW_ALPHA					0x00200000	// 00000000 00100000 00000000 00000000	半透明
#define	DRAW_ADDALPHA				0x00400000	// 00000000 01000000 00000000 00000000	加算半透明


#define	DRAW_NOT_USE_PAT_ALPHA		0x00008000	// 00000001 00000000 10000000 00000000	RGB555 パターンのαを無視

#define	DRAW_NOT_USE_TCOLOR			0x00004000	// 00000000 00000000 01000000 00000000	Indexed パターンの透明色を無視



typedef struct _PSPDRAWSTRUCT {
	int			flag;		// DRAW_NORMAL | DRAW_ZOOMX ... のように OR で指定
	int			patnum;		// パターン番号
	int			chipnum;	// チップ番号 (パターンを分割した個々)
	int			x;			// X 座標
	int			y;			// X 座標
	int			param;		// 輝度、透明度、アルファ (0 ～ 255)
	int			zoomx;		// 横拡大 (256が x1)
	int			zoomy;		// 縦拡大 (256が x1)
} PSPDRAWSTRUCT;



//-----------------------------------------------------------------------------------------------
// それぞれの関数の詳細は myproc.c を参照してください
//

//-----------------------------------------------------------------------------------------------------
// 色々と初期化。最初にコールすること
//-----------------------------------------------------------------------------------------------------
void	nDrawRoutineInit();


//-----------------------------------------------------------------------------------------------------
// クリップ設定・取得
//-----------------------------------------------------------------------------------------------------
void	setScreenClip(int left, int top, int right, int bottom);
void	getScreenClip(int *left, int *top, int *right, int *bottom);


//-----------------------------------------------------------------------------------------------------
// 原点位置設定・取得
//-----------------------------------------------------------------------------------------------------
void	setScreenOrigin(int left, int top);
void	getScreenOrigin(int *left, int *top);


//-----------------------------------------------------------------------------------------------------
// バイナリファイルを指定した配列に読み込む
//-----------------------------------------------------------------------------------------------------
long	loadBinaryFile(char *file, unsigned char *p, long size);


//-----------------------------------------------------------------------------------------------------
// 画像データの管理
//-----------------------------------------------------------------------------------------------------
bool	setPattern_Indexed(int num, unsigned short *data_palette, unsigned char *data_data, int w, int h, int pw, int ph);
bool	setPattern_RGB555(int num, unsigned short *data_data, int w, int h, int pw, int ph);
bool	setPattern_RGB555A8(int num, unsigned short *data_data, unsigned char *data_alpha, int w, int h, int pw, int ph);


//-----------------------------------------------------------------------------------------------------
// 透明色設定(Indexed パターンに限る)
//-----------------------------------------------------------------------------------------------------
bool	setTransparentColor(int num, int t_color);


//-----------------------------------------------------------------------------------------------------
// チップのサイズを取得
//-----------------------------------------------------------------------------------------------------
int		getPatChipWidth(int pat_num);	// チップ番号ではなくパターン番号なので注意
int		getPatChipHeight(int pat_num);


//-----------------------------------------------------------------------------------------------------
// クリップ対応：画面を塗りつぶす(アルファあり)
//		アルファが不要の時は alpha に 255 か -1 を指定する
//-----------------------------------------------------------------------------------------------------
void fillBoxA(unsigned long x1, unsigned long y1, unsigned long x2, unsigned long y2, unsigned long color, int alpha);


//-----------------------------------------------------------------------------------------------------
// クリップ対応：画面クリア
//-----------------------------------------------------------------------------------------------------
void clearVram(unsigned long color);


//-----------------------------------------------------------------------------------------------------
// クリップ・拡大縮小対応：文字列表示
//		拡大率は 256 で x1
//-----------------------------------------------------------------------------------------------------
void mh_printEx(int x,int y,char *str,int col, unsigned int mag256X, unsigned int mag256Y);


//-----------------------------------------------------------------------------------------------------
// 描画
//-----------------------------------------------------------------------------------------------------
void	patDraw(PSPDRAWSTRUCT *data);


//-----------------------------------------------------------------------------------------------------
// 表画面から裏画面への転送描画
//-----------------------------------------------------------------------------------------------------
void	bltFronttoBack(bool bEnableClip);
